benchmarkingExperiments/data/initial_experiments/16t16c1000rps.out
Running 1m test @ http://172.31.22.216:5000/yolo
  16 threads and 16 connections
  Thread calibration: mean lat.: 1895.849ms, rate sampling interval: 10149ms
  Thread calibration: mean lat.: 1875.470ms, rate sampling interval: 10117ms
  Thread calibration: mean lat.: 1890.113ms, rate sampling interval: 10117ms
  Thread calibration: mean lat.: 1839.212ms, rate sampling interval: 10059ms
  Thread calibration: mean lat.: 1859.555ms, rate sampling interval: 10002ms
  Thread calibration: mean lat.: 1833.158ms, rate sampling interval: 10027ms
  Thread calibration: mean lat.: 1850.480ms, rate sampling interval: 10125ms
  Thread calibration: mean lat.: 1831.958ms, rate sampling interval: 10027ms
  Thread calibration: mean lat.: 1851.702ms, rate sampling interval: 10084ms
  Thread calibration: mean lat.: 1866.932ms, rate sampling interval: 10067ms
  Thread calibration: mean lat.: 1825.011ms, rate sampling interval: 10010ms
  Thread calibration: mean lat.: 1882.553ms, rate sampling interval: 10141ms
  Thread calibration: mean lat.: 1875.735ms, rate sampling interval: 10117ms
  Thread calibration: mean lat.: 1892.085ms, rate sampling interval: 10174ms
  Thread calibration: mean lat.: 1902.385ms, rate sampling interval: 10133ms
  Thread calibration: mean lat.: 1875.223ms, rate sampling interval: 10092ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.63s     5.79s   24.41s    52.03%
    Req/Sec    37.47      3.58    42.00     76.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.77s 
 75.000%   20.71s 
 90.000%   23.00s 
 99.000%   24.18s 
 99.900%   24.35s 
 99.990%   24.41s 
 99.999%   24.43s 
100.000%   24.43s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5472.255     0.000000            1         1.00
    7036.927     0.100000         3119         1.11
    8495.103     0.200000         6244         1.25
   10608.639     0.300000         9360         1.43
   12222.463     0.400000        12490         1.67
   13770.751     0.500000        15597         2.00
   14934.015     0.550000        17156         2.22
   16375.807     0.600000        18719         2.50
   17022.975     0.650000        20285         2.86
   17678.335     0.700000        21865         3.33
   20709.375     0.750000        23404         4.00
   21233.663     0.775000        24192         4.44
   21676.031     0.800000        24953         5.00
   21987.327     0.825000        25736         5.71
   22298.623     0.850000        26514         6.67
   22593.535     0.875000        27292         8.00
   22790.143     0.887500        27704         8.89
   23003.135     0.900000        28104        10.00
   23183.359     0.912500        28494        11.43
   23347.199     0.925000        28872        13.33
   23494.655     0.937500        29253        16.00
   23576.575     0.943750        29468        17.78
   23642.111     0.950000        29647        20.00
   23707.647     0.956250        29830        22.86
   23789.567     0.962500        30041        26.67
   23887.871     0.968750        30227        32.00
   23937.023     0.971875        30320        35.56
   24002.559     0.975000        30443        40.00
   24035.327     0.978125        30516        45.71
   24084.479     0.981250        30645        53.33
   24117.247     0.984375        30723        64.00
   24133.631     0.985938        30766        71.11
   24150.015     0.987500        30811        80.00
   24166.399     0.989062        30856        91.43
   24182.783     0.990625        30898       106.67
   24215.551     0.992188        30971       128.00
   24215.551     0.992969        30971       142.22
   24231.935     0.993750        31010       160.00
   24248.319     0.994531        31035       182.86
   24264.703     0.995313        31068       213.33
   24281.087     0.996094        31093       256.00
   24281.087     0.996484        31093       284.44
   24281.087     0.996875        31093       320.00
   24297.471     0.997266        31115       365.71
   24313.855     0.997656        31130       426.67
   24313.855     0.998047        31130       512.00
   24330.239     0.998242        31145       568.89
   24330.239     0.998437        31145       640.00
   24346.623     0.998633        31162       731.43
   24346.623     0.998828        31162       853.33
   24346.623     0.999023        31162      1024.00
   24363.007     0.999121        31175      1137.78
   24363.007     0.999219        31175      1280.00
   24363.007     0.999316        31175      1462.86
   24363.007     0.999414        31175      1706.67
   24363.007     0.999512        31175      2048.00
   24379.391     0.999561        31178      2275.56
   24379.391     0.999609        31178      2560.00
   24395.775     0.999658        31181      2925.71
   24395.775     0.999707        31181      3413.33
   24412.159     0.999756        31187      4096.00
   24412.159     0.999780        31187      4551.11
   24412.159     0.999805        31187      5120.00
   24412.159     0.999829        31187      5851.43
   24412.159     0.999854        31187      6826.67
   24412.159     0.999878        31187      8192.00
   24412.159     0.999890        31187      9102.22
   24412.159     0.999902        31187     10240.00
   24428.543     0.999915        31190     11702.86
   24428.543     1.000000        31190          inf
#[Mean    =    14633.845, StdDeviation   =     5792.472]
#[Max     =    24412.160, Total count    =        31190]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35694 requests in 1.00m, 6.37MB read
Requests/sec:    594.79
Transfer/sec:    108.62KB